#!/bin/bash

#здесь символы $# - кол-во аргументов, которые мы можем передавать
#строчка $# -eq 0 поможет проверить, если у нас кол-во аргументов == 0
if [ $# -eq 0 ]
then
	echo "Вы должны указать аргумент (Конкретную директорию)"
	exit 1
fi

# записываем в переменную наш аргумент
DIRECTORY=$1

#получаем список всех файлов из нужной директории
FILES_LIST=$(ls -p "$DIRECTORY" | grep -v /)

#проходимся по каждому файлу их собранного списка
for FILE in $FILES_LIST
do
#проверям условием расширение файла именно по формату txt
	if [[ "$FILE" == *.txt ]]
	then
#если файл подходит - проверям есть ли у него права на запись и чтение
		if [[ ! -r "$FILE" ]] || [[ ! -w "$FILE" ]]
		then
#если прав нет - добавляем права на чтение и запись
			chmod u=rw,g=rw,o=rw "$DIRECTORY/$FILE"
		fi
	fi

done

echo "Права на чтение и запись добавлены."
